podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/PDB0_MK28F15.svd.xml
               <register>
                  <name>S</name>
                  <description>Channel %s Status Register</description>
                  <addressOffset>0x4</addressOffset>
                  <fields>
                     <field>
                        <name>ERR</name>
                        <description>PDB Channel Sequence Error Flags</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0b0</name>
                              <description>No error\tSequence error not detected on PDB channel&apos;s corresponding pre-trigger</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b1</name>
                              <description>Error\tSequence error detected on PDB channel&apos;s corresponding pre-trigger. ADCn block can be triggered for a conversion by one pre-trigger from PDB channel n. When one conversion, which is triggered by one of the pre-triggers from PDB channel n, is in progress, new trigger from PDB channel&apos;s corresponding pre-trigger m cannot be accepted by ADCn, and ERR[m] is set. Writing 1&apos;s to clear the sequence error flags</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>CF</name>
                        <description>PDB Channel Flags\n
The CF[m] bit is set when the PDB counter matches the CHnDLYm. Write 0 to clear these bits</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>8</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0b0</name>
                              <description>No match\thas occurred since flag last cleared</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b1</name>
                              <description>Match\thas occurred since flag last cleared</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <dim>2</dim>
                  <dimIncrement>4</dimIncrement>
                  <dimIndex>0,1</dimIndex>
                  <name>DLY%s</name>
                  <description>Channel Delay %s Register\n
Specifies the delay value for the channel&apos;s corresponding pre-trigger. \n
The pre-trigger asserts when the counter is equal to DLY. \n
Reading this field returns the value that is effective for the current cycle</description>
                  <addressOffset>0x8</addressOffset>
                  <fields>
                     <field>
                        <name>DLY</name>
                        <description>PDB Channel Delay</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
            <register>
               <name>INTC</name>
               <description>DAC Interval Trigger n Control register</description>
               <addressOffset>0x150</addressOffset>
               <fields>
                  <field>
                     <name>TOE</name>
                     <description>DAC Interval Trigger Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EXT</name>
                     <description>DAC External Trigger Input Enable\n
Enables the external trigger for DAC interval counter</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Disabled\tDAC interval counter is reset and counting starts when a rising edge is detected on selected trigger input source or software trigger is selected and SWTRIG is written with 1</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Enabled\tDAC external trigger input enabled. DAC interval counter is bypassed and DAC external trigger input triggers the DAC interval trigger</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>INT</name>
               <description>DAC Interval n Register\n
Specifies the interval value for DAC interval trigger. DAC interval trigger triggers DAC[1:0] update when the DAC interval counter is equal to the DACINT. Reading this field returns the value of internal register that is effective for the current PDB cycle</description>
               <addressOffset>0x154</addressOffset>
               <fields>
                  <field>
                     <name>INT</name>
                     <description>DAC Interval</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>POEN</name>
               <description>Pulse-Out Enable Register</description>
               <addressOffset>0x190</addressOffset>
               <fields>
                  <field>
                     <name>POEN</name>
                     <description>PDB Pulse-Out Enable\n
Enables the pulse output. Only lower Y bits are implemented in this MCU</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <dim>2</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0,1</dimIndex>
               <name>PO%sDLY</name>
               <description>Pulse-Out %s Delay Register</description>
               <addressOffset>0x194</addressOffset>
               <fields>
                  <field>
                     <name>DLY2</name>
                     <description>PDB Pulse-Out Delay 2 (low change time)\n
Pulse-Out goes low when the PDB counter is equal to the DLY2. \n
Reading these bits returns the value that is effective for the current cycle</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>DLY1</name>
                     <description>PDB Pulse-Out Delay 1 (high change time)\n
Pulse-Out goes high when the PDB counter is equal to the DLY1. \n
Reading these bits returns the value that is effective for the current cycle</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
